blog/2026-06-28.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-06-28 Sun 23:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>36th Chamber</title>
<meta name="author" content="Eryk Banatt" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<!-- Global site tag (gtag.js) - Google Analytics -->


<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">



<link rel="stylesheet" type="text/css" href="https://planetbanatt.net/css/default_20240614.css" />
<link rel="shortcut icon" type="image/jpg" href="https://planetbanatt.net/favicon.ico" />
</head>
<body>
<div id="preamble" class="status">

<!-- heading -->
<!-- add here -->

<!-- Fixed navbar -->
    <nav class="navbar navbar-default navbar-fixed-top">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#navbar" aria-expanded="false" aria-controls="navbar">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
        </div>

        <div id="navbar" class="navbar-collapse collapse">
          <ul class="nav navbar-nav ml-auto" style="margin-left:3%">
            <li class="nav-item"><a href="http://planetbanatt.net/">Home</a></li>
            <li><a href="http://planetbanatt.net/about.html">About</a></li>
            <li><a href="http://planetbanatt.net/projects.html">Projects</a></li>
            <li><a href="http://planetbanatt.net/melee/index.html">Melee</a></li>
            <li><a href="http://planetbanatt.net/links.html">Links</a></li>
            <li><a href="http://planetbanatt.net/blog/">Blog</a></li>
            <li><a href="http://planetbanatt.net/resume.pdf">Resume</a></li>
            <li class="dark-mode-nav-item"><a href="#" class="dark-mode-toggle-nav" onclick="toggleDarkMode(); return false;">🌙</a></li>
          </ul>
          </ul>
        </div><!--/.nav-collapse -->
    </nav>
</div>
<div id="content" class="content">
<h1 class="title">36th Chamber</h1>
<div id="table-of-contents" role="doc-toc">
<h1>Table of Contents</h1>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org41ab1ed">The 36th Chamber of Shaolin</a></li>
</ul>
</div>
</div>

<div id="outline-container-org41ab1ed" class="outline-1">
<h1 id="org41ab1ed">The 36th Chamber of Shaolin</h1>
<div class="outline-text-1" id="text-org41ab1ed">
<p>
I watched this recently, and it was a genuinely insane movie to watch right after <i>Marty Supreme</i>. Liu Yu-de is powerless to defeat General Tien Ta, and wishes he knew kung fu so he can defend himself. So he journeys to the temple, and learns kung fu. He spends 6 years ambitiously studying kung fu, getting through almost all the chambers of the temple which all teach a single thing, gets very good at it, then goes to defeat Tien Ta. He then opens a new chamber where he teaches kung fu to laypeople so they can defend themselves, the titular 36th temple. The end.
</p>

<p>
If that description seems short, that's because almost the entire film's runtime is just him spending the entire time learning kung fu, and getting through the chambers. The <i>purpose</i> of all of this is so he can defeat Tien Ta and prevent the tyranny of future Tien Tas. But this stuff is mostly just the outer layers of the movie, only really in the beginning and the ending. He can only do this stuff if he becomes a master, and he becomes a master in a completely reasonable, but commendably fast amount of time. He doesn't even ascend to the 35th chamber, which lets you unlock special Chi powers.
</p>

<p>
It feels like movie is communicating something like "you can get good at really hard things if you just spend a few years working very hard at it" and for that reason it's one of my favorite films I've seen in a long time. It's a love letter to <i>grinding</i>. The scenes where he's shadowboxing in the bamboo groves against the discipline chief juxtoposed with those moves being more complex in reality are some of the coolest representations I've seen in a film like this.
</p>

<p>
People generally don't get good at things because they don't like to envision the path of mediocrity necessary to cross to become as good as they want. But that path is usually very crossable. You just have to start the journey, and not give up.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<a href="#top">Back to Top</a>
</div>
</body>
</html>
